Injenus/Real_Mobile_Robot_ATmega_Linux/main_ard/src/main.cpp
/*
   Приводной уровень для двухколёсного мобильного робота на Atmega328p (Arduino Nano).
   Оснащён:
   1) Два привода колёс (servo 360) (direct PWM)
   2) IMU MPU6050 (I2C)
   3) Поворотный лазерный дальномер (VL53L0X + servo 180) (I2C + direct PWM)
   4) Приёмо-передатчик NRF24L01 (SPI)
   5) Два ИК-датчика цифр. (direct Analog)
   6) Два магнитных одометра (direct Analog)
   7) 4 механичеcких концевика (через мультиплексор, direct 2 pin)
   8) Манипулятор (4 servo, через PCA9875, I2C)

   Режим работы выбирается высоким уровнем по UART:
   0 - по умолчанию - ручой режим (с пульта NRF24L01)
   1 - режим задания 1
   2 - режим задания 2
   ...

   В ручном режиме по UART ничего не отправляем, только слушаем периодически.
   Один стик для робота, другой для манипулятора (ось Z вместо Y при нажатой другой кнопке)

   Не в ручном - шлём и принимаем.

   В любой режиме шлём пакет вида:
   %<hash><mode_left_wh>,<mode_right_wh>,<mode_move>,<x>,<y>,<z>,<grip>,<...9 mpu data>,<odo_l>,<odo_r>,<IR_left>,<IR_right>,<IR_3>,<sw1>,<sw2>,<sw3>,<sw4>,<lidar_angle>,<lidar_dist>,<sonar_1>,<sonar_2>;/n = 62 bytes

  Сначала шлёт МК, потом (по принятию) шлёт ПК
*/

#define IS_TEST_UART 0

#if (!IS_TEST_UART)
#include <I2Cdev.h>
#include <MPU6050_6Axis_MotionApps20.h>
#include <SPI.h>
#include <nRF24L01.h>
#include <RF24.h>
#include <Adafruit_VL53L0X.h>
#include <ServoDriverSmooth.h>
#include <Servo.h>
#endif
// #include <stdint.h>
#include <Arduino.h>

#define CTRL_MLTX 3
#define NUM_IR 2
#define NUM_END 4
#define DATA_NRF 6
const uint8_t MODE = 2;

struct Timer
{
  uint32_t main = 0;
  uint32_t tx = 0;
  uint32_t rx = 0;
  uint32_t nrf_t = 0;
  uint32_t nrf_r = 0;
  uint32_t set_wheel = 0;
  uint32_t set_arm = 0;
  uint32_t set_periph = 0;
  uint32_t check_mltx = 0;
  uint32_t check_lidar = 0;
  uint32_t check_imu = 0;
  uint32_t check_odo = 0;
  uint32_t check_nrf = 0;
};
Timer tmr;

struct Period
{
  const uint32_t main = 0;
  const uint32_t tx = 48;
  const uint32_t rx = 49;
  const uint32_t nrf_t = 5;
  const uint32_t nrf_r = 5;
  const uint32_t set_wheel = 30;
  const uint32_t set_arm = 30;
  const uint32_t set_periph = 5;
  const uint32_t check_mltx = 15;
  const uint32_t check_lidar = 5;
  const uint32_t check_imu = 15;
  const uint32_t check_odo = 5;
  const uint32_t check_nrf = 100;
};
Period PRD;

struct Num
{
  const uint8_t arm = 4;
  const uint8_t ir = 2;
  const int end_sens = 4;
  const int mltx_ctrl = 3;
};
Num num;

struct Arm
{
  const uint8_t base = 0;
  const uint8_t first = 1;
  const uint8_t second = 2;
  const uint8_t gripper = 3;
};

struct Multiplexor
{
  const uint8_t s_ctrl[CTRL_MLTX] = {15, 16, 17}; // A1 A2 A3  //num.mltx_ctrl
  const uint8_t sig = 14;                         // A0
  const uint8_t ir[NUM_IR][CTRL_MLTX] = {         // num.ir  //num.mltx_ctrl
      {0, 0, 0},
      {1, 0, 0}};
  const uint8_t end_sens[NUM_END][CTRL_MLTX] = { // num.end_sens  //num.mltx_ctrl
      {0, 1, 0},
      {1, 1, 0},
      {0, 0, 1},
      {1, 0, 1}};
  int8_t pin_mode = 0;
};

struct Pin
{ // reserved A4-A5(18-19)(I2C), 11-13(SPI), 0-1(UART), 2-3(extrn. interr.)
  const uint8_t left_wh = 9;
  const uint8_t right_wh = 10;
  const uint8_t CE = 7;
  const uint8_t CSN = 8;
  const uint8_t lidar_servo = 5;
  const uint8_t left_odo = 20;  // A6
  const uint8_t right_odo = 21; // A7
  Arm arm;
  Multiplexor mltx;
};
Pin pin;

struct Rec_nrf
{
  int16_t data[DATA_NRF];
  uint8_t pipeNo;
  int16_t x1 = 512;
  int16_t y1 = 512;
  int16_t x2 = 512;
  int16_t y2 = 512;
  uint8_t btn1 = 0;
  uint8_t btn2 = 0;
};
Rec_nrf rec_nrf;

struct Transmit
{
  char start_sb = '%';
  // char end_sb = ';';
  // char terminator = ',';
  uint8_t hsum = 0x09;
  int16_t left_wh = 0;
  int16_t right_wh = 0;
  int16_t mode_move = 3; // сейчас считаем это за индикатор состяния последней команды 1 - выполнено, 0 - выполняется
  int16_t x_arm = 90;
  int16_t y_arm = 90;
  int16_t z_arm = 90;
  int16_t mode_arm = -1;
  int16_t ax = -123;
  int16_t ay = -1234;
  int16_t az = -12345;
  int16_t gx = -123;
  int16_t gy = -1234;
  int16_t gz = -12345;
  int16_t ang_x = -123;
  int16_t ang_y = -1234;
  int16_t ang_z = -12345;
  int16_t odo_l = 1;
  int16_t odo_r = 2;
  int16_t lidar_angle = 3;
  int16_t lidar_dist = 4;
  int16_t sonar_1 = 5;
  int16_t sonar_2 = 6;
  int8_t ir = 0b00000011;       // 0b00000011
  int8_t end_sens = 0b00001111; // 0b00001111
};
Transmit tx;

struct Receive
{
  char init_sb = '#';
  uint8_t hsum = 9;
  int8_t move_type = 0;
  int8_t val_move = 0;
  int16_t arm_q1 = 90;
  int16_t arm_q2 = 90;
  int16_t arm_q3 = 90;
  int8_t arm_mode = -1;
  int8_t auido_mode = -1;
};
Receive rx;

struct Buff
{
  volatile uint8_t rx[11] = {0, 0, 3, 3, 3, 3, 3, 3, 3, 3, 3}; // hsum + 2*1 + 3*2 + 2*1
  volatile uint8_t two_bytes[2];
  volatile uint8_t tx[48]; // hsum + 22*2+2
  volatile uint8_t tx_add[16];
  volatile uint8_t nrf_rec[12];
};
Buff buff;
volatile bool rx_flag = false;

struct Pid
{
  int32_t p = 1000;
  int32_t i = 100;
  int32_t d = 10;

  int32_t prev_er = 0;
  int32_t integral = 0;
  int32_t constr[2] = {100, 1000};
};

struct MG_996_R_360
{
  int16_t const dead_zone = 21; // +- relative to 90
  int16_t const min_v = 0;      // >=0 <90    55 is good
  int16_t const stop_v = 90;    //
  int16_t const max_v = 180;    // >90 <=180   125 is good
  int16_t const min_prd = 600;
  int16_t const stop_prd = 1500;
  int16_t const max_prd = 2400;
};
MG_996_R_360 mg996;

const uint8_t WHEEL_NUM = 2;
struct Wheel
{
  Servo servo[WHEEL_NUM];
  bool const is_direct[WHEEL_NUM] = {true, false};
  int16_t const min_spd = -1000;
  int16_t const max_spd = 1000;
  int16_t abstr_spd[WHEEL_NUM] = {0, 0};
};
Wheel wheel;

struct Platform
{
  int16_t loc_init_ang[3] = {0, 0, 0}; // x y z
  int16_t target_type = 0;
  int16_t target_val = 0;
  // bool is_done_move = false;
  uint32_t tmr[5] = {0, 0, 0, 0, 0};
  uint32_t prd[5] = {750, 750, 750, 3600000, 3600000};
  int16_t stop[WHEEL_NUM] = {0, 0};
  int16_t forw[WHEEL_NUM] = {wheel.max_spd * 0.005, -wheel.max_spd * 0.005};
  int16_t backw[WHEEL_NUM] = {wheel.min_spd * 0.005, -wheel.min_spd * 0.005};
  Pid pid;
};
