Injenus/Real_Mobile_Robot_ATmega_Linux/main_ard/src/main.cpp
Platform plat;

#if (!IS_TEST_UART)
RF24 radio(pin.CE, pin.CSN);                                                // "создать" модуль на пинах 9 и 10 Для Уно
byte address[][6] = {"1Node", "2Node", "3Node", "4Node", "5Node", "6Node"}; // возможные номера труб
byte pipeNo = 1;

ServoDriverSmooth arm_servo[4](0x40);

MPU6050 mpu;
Quaternion q;
VectorFloat gravity;
float ypr[3];
uint8_t fifoBuffer[45];

// ###############3

void nrf_set();
void mpu_set();

void get_imu();
void get_mltx();
void get_lidar();
void get_odo();
void tr_nrf();
void rc_nrf();
#endif
void tx_uart();
void rx_uart();

float middle_of_3(float *a, float *b, float *c);

int8_t to_int8(uint8_t val);
int16_t to_int16(uint8_t val_1, uint8_t val_2, uint8_t *val_i);
uint8_t from_int8(int8_t val);
void from_int16(int16_t val, uint8_t *int_buff);
uint8_t hash(uint8_t *data, uint32_t start_i, uint32_t end_i);
bool check_data(uint8_t *data_rec, uint32_t start_i, uint32_t end_i);

void update_control_data();
void send_buff(uint8_t *buff, uint8_t size);
void fill_tx_arr();
void buff_to_tx_buff(uint8_t *ind, uint8_t *int_buff);

void set_PWM_wheel(int16_t left_sp, int16_t right_sp);
void set_directly_wheel(int16_t left_val, int16_t right_val);
int16_t convertSpeedToVal(int16_t speed_);
/*
 *  не регаируем на поток байтов, пока не увидим #
 *  после этого всё приходящее кладём в rx_buffer
 *  как заполнится - чекаем хэш-сумму
 *  если всё ок - принимаем, парсим
 *
 *  если во время заполнения буфера снова увидели #, то начинаем всё заново
 */

void setup()
{
  if (MODE < 2)
  {
    Serial.begin(1000000);
  }
  else
  {
    Serial.begin(115200);
  }
  Serial.setTimeout(10);
  Serial.print("Freq clock is ");
  Serial.print(F_CPU);
  Serial.println(" Hz");
#if (!IS_TEST_UART)
  nrf_set();
  mpu_set();
#endif
  for (uint8_t i = 0; i < CTRL_MLTX; i++)
  {
    pinMode(pin.mltx.s_ctrl[i], OUTPUT);
  }

  pinMode(2, OUTPUT);
  pinMode(3, OUTPUT);

  wheel.servo[0].attach(pin.left_wh, mg996.min_prd, mg996.max_prd);
  wheel.servo[1].attach(pin.right_wh, mg996.min_prd, mg996.max_prd);
  for (int i = 0; i < WHEEL_NUM; i++)
  {
    wheel.servo[i].write(90);
  }

  buff.tx[0] = uint8_t(tx.start_sb);

  //  UCSROB = (1<<RXEND) | (1<<RXCIEO); // разрешение перрваания по получению
}

// ISR (USART_RX_vect){
//   Serial.println("smth");
// }

void loop()
{
  if (millis() - tmr.main > PRD.main)
  {
    tmr.main = millis();

    if (MODE == 0)
    {
#if (!IS_TEST_UART)
      if (millis() - tmr.nrf_r > PRD.nrf_r)
      {
        tmr.nrf_r = millis();
        rc_nrf();
      }
#endif
      // ctrl by nrf
    }
    else if (MODE > 0)
    {
#if (!IS_TEST_UART)
      /// опрос всего
      if (millis() - tmr.check_imu > PRD.check_imu)
      {
        tmr.check_imu = millis();
        get_imu();
      }

      if (millis() - tmr.check_mltx > PRD.check_mltx)
      {
        tmr.check_mltx = millis();
        get_mltx();
      }

      if (millis() - tmr.check_lidar > PRD.check_lidar)
      {
        tmr.check_lidar = millis();
      }

      if (millis() - tmr.check_odo > PRD.check_odo)
      {
        tmr.check_odo = millis();
      }
#endif
      // отправка сборанной инфы
      if (millis() - tmr.tx > PRD.tx)
      {
        tmr.tx = millis();
        // Serial.println("TX");
        fill_tx_arr(); // заполнение массива на отправку собранными данными
        tx_uart();     // отправка
      }
      // приём, чек, парсинг и устанвока упарвляющей инфы
      if (millis() - tmr.rx > PRD.rx && MODE != 2)
      {
        tmr.rx = millis();
        rx_uart(); // так вышло, что тут всё, - приняли и уставки сразу актуальные, если прошло проверку
      }

      // устанвока колёс
      if (millis() - tmr.set_wheel > PRD.set_wheel)
      {
        tmr.set_wheel = millis();
        if (tx.mode_move != 0)
        {
          digitalWrite(3, 0);
          // если зaвершили предыдущее движение, то делаем иниты для движения
          plat.target_type = constrain(rx.move_type, 0, 4);
          rx.move_type = 0;
          plat.target_val = -rx.val_move * 17; // 17.453  Ded to Mrad
          rx.val_move = 0;

          plat.loc_init_ang[2] = tx.ang_z;
          for (uint8_t i = 0; i < 5; i++)
          {
            plat.tmr[i] = millis();
          }
          // plat.is_done_move = false;
          tx.mode_move = 0;
        }
        else if (tx.mode_move == 0) // а если не завершили, то делаем движение, че ждём-то
        {
          digitalWrite(3, 1);
          digitalWrite(2, !plat.target_type);
          switch (plat.target_type)
          {
          case 0: // stop
            set_PWM_wheel(plat.stop[0], plat.stop[1]);
            if (millis() - plat.tmr[plat.target_type] > plat.prd[plat.target_type])
            {
              // plat.is_done_move = true;
              tx.mode_move = 1;
            }
            break;
          case 1: // прямо по углу z
            // set_PWM_wheel(plat.forw[0], plat.forw[1]);
            set_directly_wheel(mg996.stop_v + mg996.dead_zone, mg996.stop_v - mg996.dead_zone);
            if (millis() - plat.tmr[plat.target_type] > plat.prd[plat.target_type])
            {
              // plat.is_done_move = true;
              tx.mode_move = 1;
            }
            break;
          case 2: // назад по углу z
            // set_PWM_wheel(plat.backw[0], plat.backw[1]);
            set_directly_wheel(mg996.stop_v - mg996.dead_zone, mg996.stop_v + mg996.dead_zone);
            if (millis() - plat.tmr[plat.target_type] > plat.prd[plat.target_type])
            {
              // plat.is_done_move = true;
              tx.mode_move = 1;
            }
            break;
          case 3: // вращение вокруг центра оси  ang>=0 - против час.  ang<0 - по час.
            if (plat.target_val > 0)
            {
              // set_PWM_wheel(plat.backw[0], plat.forw[1]);
              set_directly_wheel(mg996.stop_v - mg996.dead_zone, mg996.stop_v - mg996.dead_zone);
              if (tx.ang_z - plat.loc_init_ang[2] > plat.target_val)
              {
                // plat.is_done_move = true;
                tx.mode_move = 1;
              }
            }
            else
            {
              // set_PWM_wheel(plat.forw[0], plat.backw[1]);
              set_directly_wheel(mg996.stop_v + mg996.dead_zone, mg996.stop_v + mg996.dead_zone);
              if (tx.ang_z - plat.loc_init_ang[2] < plat.target_val)
              {
                // plat.is_done_move = true;
                tx.mode_move = 1;
              }
            }

            break;
          case 4: // вращение вокруг колеса ang>=0 - против час.  ang<0 - по час.
            if (plat.target_val > 0)
            {
              // set_PWM_wheel(plat.stop[0], plat.forw[1]);
              set_directly_wheel(mg996.stop_v, mg996.stop_v - mg996.dead_zone);
              if (tx.ang_z - plat.loc_init_ang[2] > plat.target_val)
              {
                // plat.is_done_move = true;
                tx.mode_move = 1;
              }
            }
            else
            {
              // set_PWM_wheel(plat.forw[0], plat.stop[1]);
              set_directly_wheel(mg996.stop_v + mg996.dead_zone, mg996.stop_v);
              if (tx.ang_z - plat.loc_init_ang[2] < plat.target_val)
              {
                // plat.is_done_move = true;
                tx.mode_move = 1;
              }
            }
            break;
          default:
            // КАКАЯ_ТО ОШИБКА!!!!!!!!!!
            tx.mode_move = 9;
            break;
          }
          /*точка выхода в аждом кейсе*/
          // if (/*ang*/ (abs(tx.ang_z - plat.loc_init_ang[2]) >= abs((lat.target_val))) || /*time*/) // точка выхода из движения
          // {
          //   plat.is_done_move = true;
          //   tx.mode_move = 1;
          // }
        }
      }

