Injenus/Real_Mobile_Robot_ATmega_Linux/main_ard/src/main.cpp
      // уставнока манипуоятора
      if (millis() - tmr.set_arm > PRD.set_arm)
      {
        tmr.set_arm = millis();

        tx.x_arm = rx.arm_q1;
        tx.y_arm = rx.arm_q2;
        tx.z_arm = rx.arm_q3;
        tx.mode_arm = rx.arm_mode;
      }
      // уставнока периферии (магнит, аудио, ещё какая-нибудь хрень)
      if (millis() - tmr.set_periph > PRD.set_periph)
      {
        tmr.set_periph = millis();
        /**/
      }
    }
  }
}
#if (!IS_TEST_UART)
void nrf_set()
{
  if (MODE == 2)
  {
    radio.begin();                        // активировать модуль
    radio.setAutoAck(1);                  // режим подтверждения приёма, 1 вкл 0 выкл
    radio.setRetries(0, 15);              // (время между попыткой достучаться, число попыток)
    radio.enableAckPayload();             // разрешить отсылку данных в ответ на входящий сигнал
    radio.setPayloadSize(32);             // размер пакета, в байтах
    radio.openWritingPipe(address[0]);    // мы - труба 0, открываем канал для передачи данных
    radio.openReadingPipe(1, address[0]); // хотим слушать трубу 0
    radio.setChannel(0x6a);               // выбираем канал (в котором нет шумов!)
    radio.setPALevel(RF24_PA_MAX);        // уровень мощности передатчика
    radio.setDataRate(RF24_2MBPS);        // скорость обмена
    // должна быть одинакова на приёмнике и передатчике!
    // при самой низкой скорости имеем самую высокую чувствительность и дальность!!

    radio.powerUp();       // начать работу
    radio.stopListening(); // не слушаем радиоэфир, мы передатчик
  }
  else
  {
    radio.begin();            // активировать модуль
    radio.setAutoAck(1);      // режим подтверждения приёма, 1 вкл 0 выкл
    radio.setRetries(0, 15);  // (время между попыткой достучаться, число попыток)
    radio.enableAckPayload(); // разрешить отсылку данных в ответ на входящий сигнал
    radio.setPayloadSize(32); // размер пакета, в байтах

    radio.openReadingPipe(1, address[0]); // хотим слушать трубу 0
    radio.setChannel(0x6a);               // выбираем канал (в котором нет шумов!)

    radio.setPALevel(RF24_PA_MAX); // уровень мощности передатчика. На выбор RF24_PA_MIN, RF24_PA_LOW, RF24_PA_HIGH, RF24_PA_MAX
    radio.setDataRate(RF24_2MBPS); // скорость обмена. На выбор RF24_2MBPS, RF24_1MBPS, RF24_250KBPS
    radio.powerUp();               // начать работу
    radio.startListening();        // начинаем слушать эфир, мы приёмный модуль
  }
}

void mpu_set()
{
  mpu.initialize();
  mpu.dmpInitialize();
  mpu.setDMPEnabled(true);
}
#endif

void tx_uart()
{
  // Serial.println("TX");
  if (MODE == 1)
  {
    // Serial.write(tx.start_sb);
    send_buff(buff.tx, 48);
  }
  else if (MODE == 2)
  {
#if (!IS_TEST_UART)
    for (uint8_t i = 0; i < 16; i++)
    {
      buff.tx_add[i] = buff.tx[32 + i];
    }
    radio.write(&buff.tx, 32);
    radio.write(&buff.tx_add, 16);
    if (!radio.available(&pipeNo))
    { // если получаем пустой ответ
    }
    else
    {
      while (radio.available(&pipeNo))
      {                                // если в ответе что-то есть
        radio.read(&buff.nrf_rec, 12); // читаем
        // получили забитый данными массив telemetry ответа от приёмника
        for (uint8_t i = 0; i < 11; i++)
        {
          buff.rx[i] = buff.nrf_rec[i + 1];
        }
      }
      update_control_data();
    }
#endif
  }
}

void rx_uart()
{
  // Serial.println("RX");
  if (MODE == 1)
  {
    static uint8_t i;
    if (Serial.available())
    {
      // Serial.println();
      if (rx_flag)
      {
        buff.rx[i++] = Serial.read();
        // Serial.println(int8_t(rx_buff[i-1]));
        if (i > 10)
        {
          rx_flag = false;
          i = 0;
          // send_buff();
          update_control_data();
        }
      }
      else
      {
        if (char(Serial.read()) == rx.init_sb)
        {
          // Serial.println(rx.init_sb);
          rx_flag = true;
          i = 0;
        }
      }
    }
  }
  else if (MODE == 2)
  {
  }
}

void send_buff(uint8_t *buff, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    Serial.write(buff[i]);
  }
}
void update_control_data()
{
  /*int8_t move_type = -1;
  int8_t val_move = -1;
  int16_t arm_q1 = 90;
  int16_t arm_q2 = 90;
  int16_t arm_q3 = 90;
  int8_t arm_mode = -1;
  int8_t auido_mode = -1;*/

  rx.hsum = hash(buff.rx, 1, 11);
  if (rx.hsum == buff.rx[0])
  {
    uint8_t i = 0;
    rx.move_type = to_int8(buff.rx[1]);
    rx.val_move = to_int8(buff.rx[2]);
    rx.arm_q1 = to_int16(buff.rx[3], buff.rx[4], &i);
    rx.arm_q2 = to_int16(buff.rx[5], buff.rx[6], &i);
    rx.arm_q3 = to_int16(buff.rx[7], buff.rx[8], &i);
    i = 8;
    rx.arm_mode = to_int8(buff.rx[9]);
    rx.auido_mode = to_int8(buff.rx[10]);
  }
  else
  {
    uint8_t i = 0;
    rx.move_type = to_int8(buff.rx[1]);
    rx.val_move = to_int8(buff.rx[2]);
    rx.arm_q1 = to_int16(buff.rx[3], buff.rx[4], &i);
    rx.arm_q2 = to_int16(buff.rx[5], buff.rx[6], &i);
    rx.arm_q3 = to_int16(buff.rx[7], buff.rx[8], &i);
    rx.arm_mode = to_int8(buff.rx[9]);
    rx.auido_mode = 0;
  }
}

#if (!IS_TEST_UART)
void rc_nrf()
{
  if (millis() - tmr.check_nrf > PRD.check_nrf)
  {
    rec_nrf.x1 = 512;
    rec_nrf.y1 = 512;
    rec_nrf.x2 = 512;
    rec_nrf.y2 = 512;
    rec_nrf.btn1 = 0;
    rec_nrf.btn2 = 0;
    // потеряли пульт, стоим
  }
  else if (radio.available(&rec_nrf.pipeNo))
  { // слушаем эфир со всех труб
    tmr.check_nrf = millis();
    radio.read(&rec_nrf.data, sizeof(rec_nrf.data)); // чиатем входящий сигнал
    rec_nrf.x1 = rec_nrf.data[0];
    rec_nrf.y1 = rec_nrf.data[1];
    rec_nrf.x2 = rec_nrf.data[2];
    rec_nrf.y2 = rec_nrf.data[3];
    rec_nrf.btn1 = rec_nrf.data[4];
    rec_nrf.btn2 = rec_nrf.data[5];
  }
}

void tr_nrf()
{
}

void get_imu()
{
  if (mpu.dmpGetCurrentFIFOPacket(fifoBuffer))
  {
    mpu.dmpGetQuaternion(&q, fifoBuffer);
    mpu.dmpGetGravity(&gravity, &q);
    mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);

    // tx.ang_x = degrees(ypr[2]) * 1000;
    // tx.ang_y = degrees(ypr[1]) * 1000;
    // tx.ang_z = degrees(ypr[0]) * 1000;
    tx.ang_x = ypr[2] * 1000;
    tx.ang_y = ypr[1] * 1000;
    tx.ang_z = ypr[0] * 1000;
  }
}
void set_mltx(uint8_t *mode, uint8_t *val_map)
{
  switch (*mode)
  {
  case 0:
    pinMode(pin.mltx.sig, INPUT_PULLUP);
    break;
  case 1:
    pinMode(pin.mltx.sig, INPUT);
    break;
  case 2:
    pinMode(pin.mltx.sig, OUTPUT);
    break;
  }
  for (uint8_t i = 0; i < CTRL_MLTX; i++)
  {
    digitalWrite(pin.mltx.s_ctrl[i], val_map[i]);
  }
}

void get_mltx()
{
  tx.ir = 0b00000000;
  for (uint8_t i = 0; i < NUM_IR; i++)
  {
    set_mltx(&pin.mltx.pin_mode, pin.mltx.ir[i]);
    tx.ir = tx.ir | (digitalRead(pin.mltx.sig) << i);
  }
  tx.end_sens = 0b00000000;
  for (uint8_t i = 0; i < NUM_END; i++)
  {
    set_mltx(&pin.mltx.pin_mode, pin.mltx.end_sens[i]);
    tx.end_sens = tx.end_sens | (digitalRead(pin.mltx.sig) << i);
  }
}
#endif
float middle_of_3(float *a, float *b, float *c)
{
  if ((*a <= *b) && (*a <= *c))
  {
    return (*b <= *c) ? *b : *c;
  }
  else
  {
    if ((*b <= *a) && (*b <= *c))
    {
      return (*a <= *c) ? *a : *c;
    }
    else
    {
      return (*a <= *b) ? *a : *b;
    }
  }
}

int8_t to_int8(uint8_t val)
{
  return int8_t(val);
}

int16_t to_int16(uint8_t val_1, uint8_t val_2, uint8_t *val_i)
{
  // inc(&(*val_i));
  return int16_t((val_2 << 8) | val_1);
}

