Injenus/Real_Mobile_Robot_ATmega_Linux/main_ard/src/main.cpp
uint8_t from_int8(int8_t val)
{
  return uint8_t(val);
}

void from_int16(int16_t val, uint8_t *int_buff)
{
  int_buff[0] = uint8_t(val);
  int_buff[1] = uint8_t(val >> 8);
}
void buff_to_tx_buff(uint8_t *ind, uint8_t *int_buff)
{
  buff.tx[(*ind)++] = int_buff[0];
  buff.tx[(*ind)++] = int_buff[1];
}

uint8_t inc(uint8_t *val_i)
{
  (*val_i)++;
  return *val_i;
}

uint8_t hash(uint8_t *data, uint32_t start_i, uint32_t end_i)
{
  uint8_t ch_sum = 0;

  for (uint8_t i = start_i; i < end_i; i++)
  {
    ch_sum = (ch_sum << 3) | data[i];
    ch_sum = (ch_sum << 4) | data[i]; // ~ ch_sum*128 + 17*byte
                                      // ch_sum = (ch_sum >> 2) | arr[i]; // ~ ch_sum*64 +9.5*byte
                                      // printf("%d\r\n", ch_sum);
  }
  return ch_sum;
}

bool check_data(uint8_t *data_rec, uint32_t start_i, uint32_t end_i)
{
  uint8_t rec_hash = hash(data_rec, start_i, end_i);
  return (!(data_rec[0] == rec_hash)); // 0 - хэши совпали
}

void fill_tx_arr()
{
  uint8_t i = 2;
  //  int16_t left_wh = 5;
  //  int16_t right_wh = -1;
  //  int16_t mode_move = -1;
  //  int16_t x_arm = 256;
  //  int16_t y_arm = -1;
  //  int16_t z_arm = -1;
  //  int16_t mode_arm = -1;
  //  int16_t ax = -12345;
  //  int16_t ay = -12345;
  //  int16_t az = -12345;
  //  int16_t gx = -12345;
  //  int16_t gy = -12345;
  //  int16_t gz = -12345;
  //  int16_t ang_x = -12345;
  //  int16_t ang_y = -12345;
  //  int16_t ang_z = -12345;
  //  int16_t odo_l = -1;
  //  int16_t odo_r = -1;
  //  int16_t lidar_angle = -1;
  //  int16_t lidar_dist = -1;
  //  int16_t sonar_1 = -1;
  //  int16_t sonar_2 = -1;
  //  int8_t ir = 0b00000000;       // 0b00000011
  //  int8_t end_sens = 0b00000000; // 0b00001111

  // move
  from_int16(tx.left_wh, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.right_wh, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.mode_move, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // arm
  from_int16(tx.x_arm, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.y_arm, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.z_arm, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.mode_arm, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // from_int16(rx.arm_q1, buff.two_bytes);
  // buff_to_tx_buff(&i, buff.two_bytes);
  // from_int16(rx.arm_q2, buff.two_bytes);
  // buff_to_tx_buff(&i, buff.two_bytes);
  // from_int16(rx.arm_q2, buff.two_bytes);
  // buff_to_tx_buff(&i, buff.two_bytes);
  // from_int16(rx.arm_mode, buff.two_bytes);
  // buff_to_tx_buff(&i, buff.two_bytes);
  // accel
  from_int16(tx.ax, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.ay, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.az, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // gyro
  from_int16(tx.gx, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.gy, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.gz, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // ang
  from_int16(tx.ang_x, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.ang_y, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.ang_z, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // odo
  from_int16(tx.odo_l, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.odo_r, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // lidar
  from_int16(tx.lidar_angle, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.lidar_dist, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // sonar
  from_int16(tx.sonar_1, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  from_int16(tx.sonar_2, buff.two_bytes);
  buff_to_tx_buff(&i, buff.two_bytes);
  // ик и концевики
  buff.tx[i++] = from_int8(tx.ir);
  buff.tx[i++] = from_int8(tx.end_sens);
  // hash sum
  // buff.tx[0] = hash(buff.tx, 1, 47);
  buff.tx[1] = tx.hsum;
}
// ####################### for robot #######
void set_PWM_wheel(int16_t left_sp, int16_t right_sp) // принимает абстрактную уставку от -1000 до 1000
{
  tx.left_wh = convertSpeedToVal(left_sp);
  tx.right_wh = convertSpeedToVal(right_sp);
  wheel.servo[0].write(tx.left_wh);
  wheel.servo[1].write(tx.right_wh);
}
void set_directly_wheel(int16_t left_val, int16_t right_val)
{
  tx.left_wh = left_val;
  tx.right_wh = right_val;
  wheel.servo[0].write(tx.left_wh);
  wheel.servo[1].write(tx.right_wh);
}

int16_t convertSpeedToVal(int16_t speed_)
{
  speed_ = constrain(speed_, wheel.min_spd, wheel.max_spd);
  int16_t val = 90;
  if (speed_ < 0)
  {
    val = map(speed_, wheel.min_spd, 1, mg996.min_v, mg996.stop_v - mg996.dead_zone);
  }
  else if (speed_ > 0)
  {
    val = map(speed_, 1, wheel.max_spd, mg996.stop_v + mg996.dead_zone, mg996.max_v);
  }
  return val;
}
int16_t wheel_corr() // пид регулятор для колёс
{
}